/*
This file is rather special. It bundles locomotive prototype entries and model entries to an entry in the JMRI roster.

It is done using objects, but the syntax is very specific. You must adhere to this syntax or things will explode in fiery infernos.
*/

bundles = {
    /*
    Example entry for my Athearn Genesis GP15-1 is shown below
    
    "GP15-1 #1379":{
        model:{
            speed:function(mph) {} this is a function that returns a speed in percent from a speed in mph. it is model-specific due to gearing.
        },
        
        prototype:"EMD GP15-1"
    }
    
    The decoder settings are not here because we can grab those straight from JMRI.
    */
    "CBQ2":{
        model:{
            speed:function(mph) {
                mph = speed; //totally not correct but it is a functional example
                return speed;
            }
        },
        prototype:{
            "builder" : "EMD", //This is displayed to the client and can be anything
            "name" : "F7-A", //This is also displayed to the client and can be anything
            "type" : "locomotive", //This must be "locomotive"
            "weight" : 250000, //Weight of the locomotive in lbs
            "maxHP" : 1500, //Horsepower of the locomotive
            "frontArea" : ( ((10 * 12) + 7) * (15 * 12) ) / (12*12), //Front cross-sectional area in sq. ft
            "rearArea" : ( ((10 * 12) + 7) * (15 * 12) ) / (12*12), //Rear cross-sectional area in sq. ft.
            "dragCoefficient":1.7,
            "notchRPM" : [1, 2, 3, 4, 5, 6, 7, 8, 9],
            "notchMaxSpeeds" : [null, 7.5, 15, 22.5, 30, 37.5, 45, 52.5, 60],
            "running": false,
            "fuelUse": [3.5, 6.5, 14.5, 23.4, 33.3, 45.7, 59.6, 75.3, 93.1], //this is in order of notch with 0 being idle and 8 being Run8
            "fuelCapacity" : 1500, //in gallons
            "calc" : {
                /*
                This is an object containing several functions that I am leaving open to developers. Among these are tractive effort and a few other things that could be calculated in a number of different ways. There's no one-size-fits-all method, so I am putting this in the hands of devs.
                */
                "te" : function(speed, trainPosition) {
                    /*
                    This example uses an equation from a Virginia Tech paper
                    */
                    //First we need to convert the speed to KM/HR.
                    var efficiency = 0.72
                    var horsepower = train.all[trainPosition].prototype.maxHP * notch
                    var speedSI = speed * 1.60934
    
                    /*
                    Now we must actually use the formula from the Virginia Tech paper. It states:
                    T = 2650((np/v))
    
                    T is tractive effort in Newtons.
                    n is the efficiency coefficient (unitless)
                    p is the output horsepower
                    v is the speed in km/hr
                    */
                    var teNewtons = 2650 * ( (efficiency * horsepower)/(speedSI) )
    
                    //Now that we have the tractive effort in Newtons, we must convert it to pounds.
                    var teLbs = 0.224809 * teNewtons
                    //This is a measure of protection since the equation creates a curve that moves upwards too sharply
                    if (speed < 8.9) {
                        teLbs = 56500 * (notch.state / 8);
                    }
                    return teLbs;
                }
            },
            "realtime" : {
                speed : 0, //This is defined just to be safe.
            }, //This is used by the physics engine to store current information, we just go ahead and define it
            "gauges": {
            //this is a sub object containing all the gauge info because this would take up WAAAAY too much space to put in the main object
                "speedometer": {
                    "max":120,
                },
                "RPM": {
                    "min":0,
                    "max":900,
                },
                "Ammeter":{
                    "min":0,
                    "max":900,
                },
                "fuelTank":{
                    "max":0,
                    "min":1500,
                }
            }
        }
    }
    
}